#Вивести відомості про товари з ціною, що вище середньої. Поля структури:
#Найменування, Кількість, Ціна, Виробник, Дата надходження на склад.
#Грінченко Маргарита Володимиріна 122-Б
# 5 варіант
while True:
    data = [{'Найменування': 'Листи', 'Кількість': 130, 'Ціна': 1000, 'Виробник': 'Дольче Габана',
             'Дата надхождення та склад': '20/02/20'},
             {'Найменування': 'Папір', 'Кількість': 120, 'Ціна': 800, 'Виробник': 'Катончик',
             'Дата надхождення та склад': '18/02/20'},
            ]
    output = []
    for i in data:
        average = (i.get('Ціна'))
        if average > 900:
            output.append(i)
    for info in output:
        print(f'{info}')

    if input('Enter') == '':
        continue
    break
